Repository: SkillDary/bagit-desktop
Catalog: po/*.po
Languages: fr

source: No description
fr: Aucune description

# shortcut window
source: _General
fr: Général

# shortcut window
source: _Show Shortcuts
fr: Montrer les raccourcis

# shortcut window
source: _Quit
fr: Quitter

source: _Toggle selection mode
fr: Basculer le mode de sélection

source: _Preferences
fr: Préférences

source: _Keyboard Shortcuts
fr: Raccourcis clavier

source: _About Bagit-Desktop
fr: À propos de Bagit Desktop

source: _Please open or clone a repository.
fr: Veuillez ouvrir ou cloner un dépôt.

source: _No saved repositories!
fr: Aucun dépôt sauvegardé !

source: _Create a new repository
fr: Créer un nouveau dépôt

source: _Add an existing repository
fr: Ajouter un dépôt existant

source: _Clone a repository
fr: Cloner un dépôt

source: _Clone a repository and save profile
fr: Cloner un dépôt et enregistrer le nouveau profil

source: _Recent repositories
fr: Dépôts récents

source: _All repositories
fr: Tous les dépôts

source: _Search in all repositories...
fr: Rechercher dans tous les dépôts...

source: _Add
fr: Ajouter

source: _Select repository
fr: Sélectionnez un dépôt

source: _Select location
fr: Sélectionnez un emplacement

source: _An error has occured
fr: Une erreur est survenue.

source: _Error message
fr: Message de l'erreur

source: _Repo already present
fr: Le dépôt sélectionné est déjà présent

source: _Delete selected repositories
fr: Supprimer les dépôts sélectionnés

source: _No deleted repositories
fr: Aucun dépôt supprimé

source: _Deleted repository
fr: dépôt supprimé

source: _Deleted repositories
fr: dépôts supprimés

source: _Automatically deleted repository
fr: dépôt supprimé automatiquement

source: _Automatically deleted repositories
fr: dépôts supprimés automatiquement

source: _Repository doesn't exist anymore
fr: Le dépôt n'existe plus sur votre machine

source: _Discard file dialog
fr: Annuler les changements du fichier ?

source: _Discard folder dialog
fr: Annuler les changements du dossier ?

source: _Discard file message
fr: Vous vous apprêtez à annuler les changements effectués sur le fichier suivant :

source: _Discard folder message
fr: Vous vous apprêtez à annuler les changements effectués sur tous les fichiers du dossier suivant :

source: _Could not add repository
fr: Impossible d'ajouter le dépôt.

source: _Could not delete repository
fr: Impossible de supprimer le dépôt.

source: _Delete branch
fr: Supprimer une branche

source: _Delete branch confirmation
fr: Vous allez supprimer la branche suivante :

source: _Name of the repository
fr: Nom du dépôt

source: _Create repository location
fr: L'emplacement dans lequel sera créé le dépôt.

source: _Create a repository and save profile
fr: Créer un dépôt et enregistrer le nouveau profil

source: _Repository URL
fr: URL du dépôt

source: _Enter URL
fr: L'URL (https ou ssh) du dépôt Git que vous souhaitez cloner.

source: _Location
fr: Emplacement

source: _Saved location
fr: L'emplacement dans lequel sera cloné le dépôt.

source: _Passphrase information
fr: La phrase de passe à utiliser si la clé privée en nécessite une.

source: _No profile
fr: Aucun profil

source: _Selected profile
fr: Le profil utilisé pour commettre, pousser...

source: _HTTPS information
fr: Informations HTTPS

source: _Complementary information
fr: Informations complémentaires utilisées pour cloner un dépôt privé par exemple.

source: _Username
fr: Nom d'utilisateur

source: _Token or password
fr: Token ou mot de passe (optionnel)

source: _SSH information
fr: Informations SSH

source: _Private key path
fr: Emplacement de la clé privée (optionnel)

source: _Select private key path
fr: Sélectionnez votre clé privée

source: _PGP information
fr: Informations GPG

source: _Passphrase
fr: Phrase de passe SSH (optionnelle)

source: _Failed to open repository
fr: Impossible d'ouvrir le dépôt

source: _Selected folder is not a repository
fr: Le dossier sélectionné n'est pas un dépôt.

source: _Cloning repository
fr: Clonage du dépôt...

source: _New profile awaiting
fr: Vous avez déjà un nouveau profil en attente de complétion.

source: _Could not update Git profile
fr: Impossible de mettre à jour le profil Git.

source: _Could not add Git profile
fr: Impossible d'ajouter le profil Git.

source: _Could not delete Git profile
fr: Impossible de supprimer le profil Git.

source: _Git profiles
fr: Profils Git

source: _No git profiles!
fr: Pas de profils Git !

source: _Create one
fr: Créez en un en cliquant sur le bouton "Ajouter un profil".

source: _Add profile
fr: Ajouter un profil

source: _Save profile
fr: Sauvegarder le profil

source: _Delete profile
fr: Supprimer le profil

source: _Delete profile confirmation
fr: Voulez-vous vraiment supprimer ce profil ?

source: _Cancel
fr: Annuler

source: _Delete
fr: Supprimer

source: _Profile name
fr: Nom du profil

source: _Email address
fr: Adresse courriel

source: _Signing key
fr: Clé de signature (optionnelle)

source: _New profile
fr: Nouveau profil

source: _Name already used
fr: Ce nom de profil est déjà utilisé.

source: _Wrong email
fr: L'adresse courriel entrée n'a pas le bon format.

source: _Commit created successfully
fr: Fichiers commis

source: _Could not change Git profile
fr: Impossible de changer de profil Git.

source: _Changes
fr: Changements

source: _History
fr: Historique

source: _Commit not pushed
fr: Cette commission n'a pas encore été poussée

source: _No changed file
fr: Aucun fichier changé.

source: _Changed files
fr: fichiers changés.

source: _Changed file
fr: fichier changé.

source: _Commit subtitle format
fr: a commis le %d/%m/%Y à %H:%M

source: _Modified file
fr: Le contenu du fichier a été modifié

source: _New file
fr: Nouveau fichier

source: _Deleted file
fr: Fichier supprimé

source: _Renamed file
fr: Le fichier a été renommé

source: _File type modified
fr: Le type du fichier a été changé

source: _Commit changes
fr: Commettre les changements

source: _Fetch
fr: Récupérer

source: _No committed file
fr: Aucun fichier ne sera commis.

source: _Committed file
fr: fichier sera commis.

source: _Committed files
fr: fichiers seront commis.

source: _Author information
fr: Informations de l'auteur

source: _Author
fr: Nom de l'auteur

source: _Author email
fr: Adresse courriel de l'auteur

source: _Message indication
fr: Le message d'une commission devrait faire moins de 50 caractères.

source: _Description
fr: Description (optionnelle)

source: _GPG indication
fr: La clé de signature à utiliser si vous voulez signer votre commission (ex: 3AA5C34371567BD2).

source: _Commit
fr: Commettre

source: _Profile information
fr: Informations du profil

source: _Token or password dialog
fr: Token ou mot de passe

source: _Private key path dialog
fr: Emplacement de la clé privée

source: _Signing key dialog
fr: Clé de signature

source: _Passphrase dialog
fr: Phrase de passe

source: _Passphrase key
fr: Veuillez entrer la phrase de passe pour la clé de signature suivante :

source: _Validate
fr: Valider

source: _Push
fr: Pousser

source: _Pull
fr: Tirer

source: _Commits pushed
fr: Commissions poussées

source: _Changed files when pull
fr: Vous avez des fichiers modifiés, vous ne pouvez pas tirer la branche distante

source: _Remote branch pulled
fr: Branche distante tirée

source: _You are on
fr: Vous voici sur

source: _Status page text
fr: Vous pouvez commettre, pousser, tirer...

source: _Branch deleted
fr: Branche supprimée

source: _Missing information
fr: Informations manquantes

source: _Complete missing information
fr: Veuillez compléter les informations manquantes.

source: _Change branch
fr: Changer de branche

source: _Local branches
fr: Branches locales

source: _Untracked branches
fr: Branches non suivies

source: _Current branch
fr: Branche courante

source: _Loading branches
fr: Chargement des branches

source: _No branches
fr: Aucune branche

source: _Change branch dialog title
fr: Changer de branche ?

source: _Changes will be brought to
fr: Les changements seront apportés sur

source: _Remote branch not found
fr: Branche distante non trouvée

source: _Branch management
fr: Gestion des branches

source: _Create a new branch
fr: Créer une nouvelle branche

source: _Create branch
fr: Créer la branche

source: _Branch name
fr: Nom de la branche

source: _All branches
fr: Toutes les branches

source: _Remote
fr: Distante

source: _Untracked
fr: Non suivie

source: _Local
fr: Locale

source: _Search a branch
fr: Rechercher une branche

source: _ErrorCode_GenericError
fr: Erreur générique.

source: _ErrorCode_NotFound
fr: L'objet demandé n'a pas pu être trouvé.

source: _ErrorCode_Exists
fr: L'objet existe et empêche l'opération.

source: _ErrorCode_Ambiguous
fr: Plusieurs objets correspondent.

source: _ErrorCode_BufSize
fr: Le tampon de sortie est trop court pour contenir les données.

source: _ErrorCode_User
fr: Erreur générée par l'utilisateur.

source: _ErrorCode_BareRepo
fr: Opération non autorisée sur un dépôt vide.

source: _ErrorCode_UnbornBranch
fr: HEAD fait référence à une branche sans commissions.

source: _ErrorCode_Unmerged
fr: L'opération a été empêchée en raison d'une fusion en cours.

source: _ErrorCode_NotFastForward
fr: La référence ne pouvait pas être faite vers l'avant.

source: _ErrorCode_InvalidSpec
fr: Le format du nom/référence n'était pas valide.

source: _ErrorCode_Conflict
fr: Des conflits lors du changement de branche ont empêché l'opération.

source: _ErrorCode_Locked
fr: Le fichier verrou a empêché l'opération.

source: _ErrorCode_Modified
fr: La valeur de référence ne correspond pas à celle attendue.

source: _ErrorCode_Auth
fr: Erreur d'authentification.

source: _ErrorCode_Certificate
fr: Le certificat du serveur n'est pas valide.

source: _ErrorCode_Applied
fr: Le correctif/la fusion a déjà été appliqué.

source: _ErrorCode_Peel
fr: L'opération d'épluchage (peel) demandée n'est pas possible.

source: _ErrorCode_Eof
fr: Fin de fichier inattendue.

source: _ErrorCode_Invalid
fr: Opération ou entrée invalide.

source: _ErrorCode_Uncommitted
fr: Des modifications non commises dans l'index ont empêché l'opération.

source: _ErrorCode_Directory
fr: L'opération n'était pas valide pour un répertoire.

source: _ErrorCode_MergeConflict
fr: Un conflit de fusion existe et ne peut se poursuivre.

source: _ErrorCode_HashsumMismatch
fr: Inadéquation de la somme de hachage dans l'objet

source: _ErrorCode_IndexDirty
fr: Les modifications non enregistrées dans l'index seraient écrasées.

source: _ErrorCode_ApplyFail
fr: L'application du correctif a échoué.

source: _ErrorCode_Owner
fr: L'objet n'appartient pas à l'utilisateur actuel.

source: _ErrorClass_None
fr: Non catégorisé.

source: _ErrorClass_NoMemory
fr: La mémoire est saturée ou l'espace alloué est insuffisant.

source: _ErrorClass_Os
fr: Erreur d'appel système ou de bibliothèque système standard.

source: _ErrorClass_Invalid
fr: Entrée non valide.

source: _ErrorClass_Reference
fr: Erreur de résolution ou de manipulation d'une référence.

source: _ErrorClass_Zlib
fr: Échec de ZLib.

source: _ErrorClass_Repository
fr: État du dépôt incorrect.

source: _ErrorClass_Config
fr: Configuration incorrecte.

source: _ErrorClass_Regex
fr: Échec au niveau des expressions régulières.

source: _ErrorClass_Odb
fr: Objet corrompu.

source: _ErrorClass_Index
fr: Données d'index invalides.

source: _ErrorClass_Object
fr: Erreur lors de la création ou de l'obtention d'un objet.

source: _ErrorClass_Net
fr: Erreur réseau.

source: _ErrorClass_Tag
fr: Erreur de manipulation d'un tag.

source: _ErrorClass_Tree
fr: Valeur invalide dans l'arbre.

source: _ErrorClass_Indexer
fr: Erreur de hachage ou d'empaquetage.

source: _ErrorClass_Ssl
fr: Erreur SSL.

source: _ErrorClass_Submodule
fr: Erreur impliquant des sous-modules.

source: _ErrorClass_Thread
fr: Erreur de threading.

source: _ErrorClass_Stash
fr: Erreur lors de la manipulation d'une mise en réserve.

source: _ErrorClass_Checkout
fr: Échec du changement de branche.

source: _ErrorClass_FetchHead
fr: FETCH_HEAD invalide.

source: _ErrorClass_Merge
fr: Échec de fusion.

source: _ErrorClass_Ssh
fr: Échec de SSH.

source: _ErrorClass_Filter
fr: Erreur lors de la manipulation des filtres.

source: _ErrorClass_Revert
fr: Erreur lors de l'annulation d'un commit.

source: _ErrorClass_Callback
fr: Erreur d'un callback utilisateur.

source: _ErrorClass_CherryPick
fr: Erreur lors de la récupération sélective (cherry-pick) d'une commission.

source: _ErrorClass_Describe
fr: Impossible de décrire l'objet.

source: _ErrorClass_Rebase
fr: Erreur lors de la réorganisation (rebase).

source: _ErrorClass_Filesystem
fr: Erreur liée au système de fichiers.

source: _ErrorClass_Patch
fr: Données de correctif non valides.

source: _ErrorClass_Worktree
fr: Erreur impliquant les espaces de travail (worktrees).

source: _ErrorClass_Sha1
fr: Erreur de bibliothèque de hachage ou collision SHA-1.

source: _ErrorClass_Http
fr: Erreur HTTP.
